name: aws_sec_lake_route53
author: Antimatter
description: "AWS Route53 Resolver query log data collected with AWS Security Lake"
title: "AWS SecLake - Route53"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/aws_sec_lake/route53/icon.png"
autoloader:
  format: parquet
  multiline: true
  cloudFiles:
    schemaHints: >
      metadata struct<product:struct<version:string,name:string,feature:struct<name:string>,vendor_name:string>,profiles:array<string>,version:string>,
      cloud struct<account:struct<uid:string>,region:string,provider:string>,
      src_endpoint struct<vpc_uid:string,ip:string,port:int,instance_uid:string>,
      time bigint,
      time_dt timestamp,
      query struct<hostname:string,type:string,class:string>,
      answers array<struct<type:string,rdata:string,class:string>>,
      connection_info struct<protocol_name:string,direction:string,direction_id:int>,
      dst_endpoint struct<instance_uid:string,interface_uid:string>,
      firewall_rule struct<uid:string>,
      severity_id int,
      severity string,
      class_name string,
      class_uid int,
      category_name string,
      category_uid int,
      activity_id int,
      activity_name string,
      type_uid bigint,
      type_name string,
      rcode_id int,
      rcode string,
      disposition string,
      action string,
      action_id int,
      unmapped map<string,string>,
      accountId bigint,
      region string,
      asl_version string,
      observables array<struct<name:string,value:string,type:string,type_id:int>>,
      eventDay int,
      _rescued_data string,
      actor struct<user:struct<type:string,name:string,uid_alt:string,uid:string,account:struct<uid:string>,credential_uid:string>,session:struct<created_time_dt:timestamp,is_mfa:boolean,issuer:string>,invoked_by:string,idp:struct<name:string>>
silver:
  transform:
    - name: aws_sec_lake_route53
      filter: "class_uid = 4003"
      fields:
        - name: activity_id
          from: activity_id
        - name: activity_name
          from: activity_name
        - name: actor
          from: actor
        - name: category_uid
          from: category_uid
        - name: category_name
          from: category_name
        - name: class_uid
          from: class_uid
        - name: class_name
          from: class_name
        - name: metadata
          from: metadata
        - name: severity_id
          from: severity_id
        - name: severity
          from: severity
        - name: time
          expr: timestamp_millis(time)
        - name: time_dt
          from: time_dt
        - name: type_uid
          from: type_uid
        - name: type_name
          from: type_name
        - name: observables
          from: observables
        - name: unmapped
          from: unmapped
        - name: cloud
          from: cloud
        - name: src_endpoint
          from: src_endpoint
        - name: query
          from: query
        - name: answers
          from: answers
        - name: connection_info
          from: connection_info
        - name: dst_endpoint
          from: dst_endpoint
        - name: firewall_rule
          from: firewall_rule
        - name: rcode_id
          from: rcode_id
        - name: rcode
          from: rcode
        - name: disposition
          from: disposition
        - name: action
          from: action
        - name: action_id
          from: action_id
        - name: accountId
          from: accountId
        - name: region
          from: region
        - name: asl_version
          from: asl_version
        - name: eventDay
          from: eventDay
      utils:
        unreferencedColumns:
          preserve: true
          omitColumns:
            - time
gold:
  - name: dns_activity
    input: aws_sec_lake_route53
    fields:
      - name: activity_id
        from: activity_id
      - name: activity_name
        from: activity_name
      - name: actor
        from: actor
      - name: category_uid
        from: category_uid
      - name: category_name
        from: category_name
      - name: class_uid
        from: class_uid
      - name: class_name
        from: class_name
      - name: metadata
        from: metadata
      - name: severity_id
        from: severity_id
      - name: severity
        from: severity
      - name: time
        from: time
      - name: time_dt
        from: time_dt
      - name: type_uid
        from: type_uid
      - name: type_name
        from: type_name
      - name: observables
        from: observables
      - name: action
        from: action
      - name: action_id
        from: action_id
      - name: disposition
        from: disposition
      - name: firewall_rule
        from: firewall_rule
      - name: connection_info
        from: connection_info
      - name: dst_endpoint
        from: dst_endpoint
      - name: src_endpoint
        from: src_endpoint
      - name: answers
        from: answers
      - name: query
        from: query
      - name: rcode
        from: rcode
      - name: rcode_id
        from: rcode_id
