name: akamai_waf
author: Antimatter
description: "A preset for consuming logs generated by Akamai WAF logs"
title: "Akamai - WAF"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/akamai/waf/icon.png"
autoloader:
  format: json
  cloudFiles:
    schemaHints: >
      attackData struct<clientIP:string,clientReputation:string,configId:string,policyId:string,ruleActions:string,ruleData:string,ruleMessages:string,ruleSelectors:string,ruleTags:string,ruleVersions:string,rules:string>,
      format string,
      geo struct<asn:string,city:string,continent:string,country:string,regionCode:string>,
      httpMessage struct<bytes:string,host:string,method:string,path:string,port:string,protocol:string,query:string,requestHeaders:map<string,string>,requestId:string,responseHeaders:map<string,string>,start:string,status:string,tls:string>,
      serviceID string,
      type string,
      version string
silver:
  transform:
    - name: akamai_waf
      fields:
      - name: time
        expr: timestamp_seconds(cast(httpMessage.start AS BIGINT))
      - name: attackData
        from: attackData
      - name: format
        from: format
      - name: geo
        from: geo
      - name: httpMessage
        from: httpMessage
      - name: serviceID
        from: serviceID
      - name: type
        from: type
      - name: version
        from: version
        utils:
        unreferencedColumns:
            preserve: true
            
gold:
  - name: http_activity
    input: akamai_waf_http_activity
    fields:
      - name: time
        expr: timestamp_seconds(cast(httpMessage.start AS BIGINT))
      - name: timezone_offset
        literal: 0
      - name: connection_info.direction_id
        expr: cast("1" as int)
      - name: connection_info.direction
        literal: "Inbound"
      - name: connection_info.protocol_name
        expr: httpMessage.protocol
      - name: dst_endpoint.domain
        expr: httpMessage.host
      - name: dst_endpoint.hostname
        expr: httpMessage.host
      - name: dst_endpoint.port
        expr: httpMessage.port
      - name: dst_endpoint.type
        literal: "Server"
      - name: dst_endpoint.type_id
        expr: cast("1" as int)
      - name: activity_id
        expr: CASE WHEN LOWER(httpMessage.method) = 'connect' THEN 1 WHEN LOWER(httpMessage.method) = 'delete' THEN 2 WHEN LOWER(httpMessage.method) = 'get' THEN 3 WHEN LOWER(httpMessage.method) = 'head' THEN 4 WHEN LOWER(httpMessage.method) = 'options' THEN 5 WHEN LOWER(httpMessage.method) = 'post' THEN 6 WHEN LOWER(httpMessage.method) = 'put' THEN 7 WHEN LOWER(httpMessage.method) = 'trace' THEN 8 WHEN httpMessage.method IS NULL OR httpMessage.method = '' THEN 0 ELSE 99 END
      - name: activity_name
        expr: CASE WHEN httpMessage.method IS NULL OR httpMessage.method = '' THEN httpMessage.method ELSE CONCAT(UPPER(SUBSTRING(httpMessage.method, 1, 1)), LOWER(SUBSTRING(httpMessage.method, 2))) END
      - name: category_uid
        expr: CAST('4' AS INT)
      - name: category_name
        literal: Network Activity
      - name: class_uid
        expr: CAST('4002' AS INT)
      - name: class_name
        literal: HTTP Activity
      - name: severity_id
        expr: CAST('0' AS INT)
      - name: severity
        literal: Unknown
      - name: type_uid
        expr: CAST((400200 + CASE WHEN LOWER(httpMessage.method) = 'connect' THEN 1 WHEN LOWER(httpMessage.method) = 'delete' THEN 2 WHEN LOWER(httpMessage.method) = 'get' THEN 3 WHEN LOWER(httpMessage.method) = 'head' THEN 4 WHEN LOWER(httpMessage.method) = 'options' THEN 5 WHEN LOWER(httpMessage.method) = 'post' THEN 6 WHEN LOWER(httpMessage.method) = 'put' THEN 7 WHEN LOWER(httpMessage.method) = 'trace' THEN 8 WHEN httpMessage.method IS NULL OR httpMessage.method = '' THEN 0 ELSE 99 END) AS BIGINT)
      - name: type_name
        expr: "CASE WHEN httpMessage.method IS NOT NULL THEN CONCAT('HTTP Activity: ', httpMessage.method) ELSE null END"
      - name: status_id
        expr: CASE WHEN CAST(httpMessage.status AS int) >= 200 AND CAST(httpMessage.status AS int) < 300 THEN 1 WHEN CAST(httpMessage.status AS int) >= 300 THEN 2 ELSE 0 END
      - name: status
        expr: CASE WHEN CAST(httpMessage.status AS int) >= 200 AND CAST(httpMessage.status AS int) < 300 THEN "Success" WHEN CAST(httpMessage.status AS int) >= 300 THEN "Failure" ELSE "Unknown" END
      - name: metadata.uid
        expr: attackData.configId
      - name: metadata.log_provider
        literal: akamai
      - name: metadata.log_name
        literal: waf
      - name: metadata.original_time
        expr: timestamp_seconds(cast(httpMessage.start AS BIGINT))
      - name: metadata.processed_time
        expr: current_timestamp()
      - name: metadata.logged_time
        expr: timestamp_seconds(cast(httpMessage.start AS BIGINT))
      - name: metadata.product.name
        literal: Kona
      - name: metadata.product.version
        from: version
      - name: metadata.product.vendor_name
        literal: Akamai
      - name: http_request.length
        expr: CAST(httpMessage.bytes AS INT)
      - name: http_request.http_method
        from: httpMessage.method
      - name: http_request.url.hostname
        from: httpMessage.host
      - name: http_request.url.path
        from: httpMessage.path
      - name: http_request.url.query_string
        from: httpMessage.query
      - name: http_request.user_agent
        from: httpMessage.requestHeaders.``User-Agent``
      - name: http_request.version
        from: httpMessage.protocol
      - name: http_request.http_headers
        expr: "transform(
                map_entries(
                  from_json(to_json(httpMessage.requestHeaders), 'map<string,string>')
                ),
                x -> named_struct('name', x.key, 'value', x.value)
              )"
      - name: http_response.code
        expr: CAST(httpMessage.status AS int)
      - name: http_response.content_type
        from: httpMessage.responseHeaders.``Content-Type``
      - name: http_response.length
        expr: CAST(httpMessage.bytes AS INT)
      - name: http_response.http_headers
        expr: "transform(
                map_entries(
                  from_json(to_json(httpMessage.responseHeaders), 'map<string,string>')
                ),
                x -> named_struct('name', x.key, 'value', x.value)
              )"
      - name: http_response.body_length
        expr: CAST(httpMessage.responseHeaders.`Content-Length` AS INT)
      - name: tls.version
        from: httpMessage.tls
      - name: src_endpoint.ip
        from: attackData.clientIP
      - name: src_endpoint.location.city
        from: geo.city
      - name: src_endpoint.location.continent
        from: geo.continent
      - name: src_endpoint.location.country
        from: geo.country
      - name: src_endpoint.location.region
        from: geo.regionCode
      - name: policy.uid
        from: attackData.policyId
      - name: message
        from: attackData.rules
      - name: raw_data
        from: attackData
      - name: action
        expr: CASE WHEN attackData.ruleActions = 'deny' THEN 'Denied' WHEN attackData.ruleActions = 'alert' OR attackData.ruleActions = 'monitor' THEN 'Observed' WHEN attackData.ruleActions = 'tarpit' THEN 'Modified' WHEN attackData.ruleActions = 'allow' THEN 'Allowed' ELSE 'Unknown' END
      - name: action_id
        expr: CASE WHEN attackData.ruleActions = 'deny' THEN 2 WHEN attackData.ruleActions = 'alert' OR attackData.ruleActions = 'monitor' THEN 3 WHEN attackData.ruleActions = 'tarpit' THEN 4 WHEN attackData.ruleActions = 'allow' THEN 1 ELSE 0 END
      - name: disposition
        expr: CASE WHEN attackData.ruleActions = 'deny' THEN 'Blocked' WHEN attackData.ruleActions = 'alert' THEN 'Alert' WHEN attackData.ruleActions = 'monitor' THEN 'Logged' WHEN attackData.ruleActions = 'tarpit' THEN 'Delayed' WHEN attackData.ruleActions = 'allow' THEN 'Allowed' ELSE 'Unknown' END
      - name: disposition_id
        expr: CASE WHEN attackData.ruleActions = 'deny' THEN 2 WHEN attackData.ruleActions = 'alert' THEN 19 WHEN attackData.ruleActions = 'monitor' THEN 17 WHEN attackData.ruleActions = 'tarpit' THEN 14 WHEN attackData.ruleActions = 'allow' THEN 1 ELSE 0 END
      - name: enrichments
        expr: "array(
                named_struct('name', 'clientReputation', 'value', attackData.clientReputation)
              )"