name: cloudflare_httpreq
author: Antimatter
title: "Cloudflare HTTP request"
description: "Cloudflare HTTP request logs"
autoloader:
  format: json
  multiline: true
  cloudFiles:
    schemaHints: "CacheCacheStatus string,CacheResponseBytes bigint,ClientASN bigint,ClientCountry string,ClientDeviceType string,ClientIP string,ClientIPClass string,ClientMTLSAuthCertFingerprint string,ClientMTLSAuthStatus string,ClientRegionCode string,ClientRequestBytes bigint,ClientRequestHost string,ClientRequestMethod string,ClientRequestPath string,ClientRequestProtocol string,ClientRequestReferer string,ClientRequestScheme string,ClientRequestSource string,ClientRequestURI string,ClientRequestUserAgent string,ClientSSLProtocol string,EdgeColoCode string,EdgeEndTimestamp string,EdgePathingOp string,EdgePathingSrc string,EdgePathingStatus string,EdgeResponseBytes bigint,EdgeResponseContentType string,EdgeResponseStatus bigint,EdgeServerIP string,EdgeStartTimestamp string,OriginIP string,OriginResponseDurationMs bigint,OriginResponseHTTPLastModified string,OriginResponseStatus bigint,OriginSSLProtocol string,ParentRayID string,RayID string,SecurityAction string,SecurityActions array<string>,SecurityRuleDescription string,SecurityRuleID string,SecurityRuleIDs array<string>,SecuritySources array<string>,WAFAttackScore bigint,WAFRCEAttackScore bigint,WAFSQLiAttackScore bigint,WAFXSSAttackScore bigint,WorkerStatus string,WorkerSubrequest boolean,ZoneName string,unmapped map<string,string>,_rescued_data string"
silver:
  transform:
    - name: cloudflare_http_requests
      fields:
        - name: ocsf_activity_id
          expr: CASE WHEN LOWER(ClientRequestMethod) = 'connect' THEN 1 WHEN LOWER(ClientRequestMethod) = 'delete' THEN 2 WHEN LOWER(ClientRequestMethod) = 'get' THEN 3 WHEN LOWER(ClientRequestMethod) = 'head' THEN 4 WHEN LOWER(ClientRequestMethod) = 'options' THEN 5 WHEN LOWER(ClientRequestMethod) = 'post' THEN 6 WHEN LOWER(ClientRequestMethod) = 'put' THEN 7 WHEN LOWER(ClientRequestMethod) = 'trace' THEN 8 WHEN ClientRequestMethod IS NULL OR ClientRequestMethod = '' THEN 0 ELSE 99 END
        - name: ocsf_category_uid
          expr: CAST('4' AS INT)
        - name: ocsf_category_name
          literal: "ocsf_category_name"
        - name: ocsf_class_uid
          expr: CAST('4002' AS INT)
        - name: ocsf_class_name
          literal: "HTTP Activity"
        - name: time
          expr: CAST(EdgeStartTimestamp AS TIMESTAMP)
        - name: ClientRequestMethod
          from: ClientRequestMethod
        - name: http_status_code
          expr: case when (EdgeServerIP != '') then OriginResponseStatus else EdgeResponseStatus end
        - name: OriginIP
          from: OriginIP
        - name: ClientRequestHost
          from: ClientRequestHost
        - name: ClientIP
          from: ClientIP
        - name: ocsf_severity_id
          expr: CAST('99' AS INT) # severity of 99 indicates it is unmapped
        - name: ocsf_type_uid
          expr: CAST(ocsf_class_uid * 100 + ocsf_activity_id AS BIGINT)
        - name: src_endpoint_type_id
          expr: CASE WHEN LOWER(ClientDeviceType) = 'server' THEN 1 WHEN LOWER(ClientDeviceType) = 'desktop' THEN 2 WHEN LOWER(ClientDeviceType) = 'laptop' THEN 3 WHEN LOWER(ClientDeviceType) = 'tablet' THEN 4 WHEN LOWER(ClientDeviceType) = 'mobile' THEN 5 WHEN LOWER(ClientDeviceType) = 'virtual' THEN 6 WHEN LOWER(ClientDeviceType) = 'iot' THEN 7 WHEN LOWER(ClientDeviceType) = 'browser' THEN 8 WHEN LOWER(ClientDeviceType) = 'firewall' THEN 9 WHEN LOWER(ClientDeviceType) = 'switch' THEN 10 WHEN LOWER(ClientDeviceType) = 'hub' THEN 11 WHEN LOWER(ClientDeviceType) = 'router' THEN 12 WHEN LOWER(ClientDeviceType) = 'ids' THEN 13 WHEN LOWER(ClientDeviceType) = 'ips' THEN 14 WHEN LOWER(ClientDeviceType) = 'load balancer' THEN 15 WHEN ClientDeviceType IS NULL OR ClientDeviceType = '' THEN 0 ELSE 99 END
        - name: ClientCountry
          from: ClientCountry
        - name: ClientRegionCode
          from: ClientRegionCode
        - name: ClientRequestReferer
          from: ClientRequestReferer
        - name: ClientRequestUserAgent
          from: ClientRequestUserAgent
        - name: ClientRequestBytes
          from: ClientRequestBytes
        - name: ClientRequestPath
          from: ClientRequestPath
        - name: EdgeResponseContentType
          from: EdgeResponseContentType
        - name: EdgeResponseStatus
          from: EdgeResponseStatus
        - name: EdgeResponseBytes
          from: EdgeResponseBytes
        - name: ClientSSLProtocol
          from: ClientSSLProtocol
        - name: EdgeEndTimestamp
          from: EdgeEndTimestamp
        - name: ClientDeviceType
          from: ClientDeviceType
        - name: ClientRequestProtocol
          from: ClientRequestProtocol
        - name: duration
          expr: DATEDIFF(SECOND, CAST(time AS TIMESTAMP), CAST(EdgeEndTimestamp AS TIMESTAMP))
      utils:
        unreferencedColumns:
          preserve: true
gold:
  - name: http_activity
    input: cloudflare_http_requests
    fields:
      - name: activity_id
        from: ocsf_activity_id
      - name: category_uid
        from: ocsf_category_uid
      - name: category_name
        from: ocsf_category_name
      - name: class_uid
        from: ocsf_class_uid
      - name: class_name
        from: ocsf_class_name
      - name: dst_endpoint.ip
        from: OriginIP
      - name: dst_endpoint.hostname
        from: ClientRequestHost
      - name: time
        from: time
      - name: metadata.version
        literal: "1.4.0"
      - name: severity_id
        from: ocsf_severity_id
      - name: type_uid
        from: ocsf_type_uid
      - name: src_endpoint.ip
        from: ClientIP
      - name: src_endpoint.type_id
        from: src_endpoint_type_id
      - name: src_endpoint.location.country
        from: ClientCountry
      - name: src_endpoint.location.region
        from: ClientRegionCode
      - name: http_request.http_method
        from: ClientRequestMethod
      - name: http_request.referrer
        from: ClientRequestReferer
      - name: http_request.user_agent
        from: ClientRequestUserAgent
      - name: http_request.length
        from: ClientRequestBytes
      - name: http_request.url.hostname
        from: ClientRequestHost
      - name: http_request.url.path
        from: ClientRequestPath
      - name: http_response.content_type
        from: EdgeResponseContentType
      - name: http_response.code
        from: http_status_code
      - name: http_response.status
        from: EdgeResponseStatus
      - name: http_response.length
        from: EdgeResponseBytes
      - name: tls.version
        from: ClientSSLProtocol
      - name: traffic.bytes_in
        from: ClientRequestBytes
      - name: traffic.bytes_out
        from: EdgeResponseBytes
      - name: duration
        from: duration
      - name: end_time_dt
        from: EdgeEndTimestamp
      - name: start_time_dt
        from: time
      - name: status_code
        from: EdgeResponseStatus
      - name: activity_name
        from: ClientRequestMethod
      - name: device.type
        from: ClientDeviceType
      - name: connection_info.protocol_name
        from: ClientRequestProtocol
