# header tags
name: cloudflare_gateway_dns
title: "Cloudflare - DNS (Gateway)"
author: Garrett R Peternel <garrett.peternel@databricks.com>
description: "A preset for Account-scoped Cloudflare datasets - DNS (Gateway)"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/cloudflare/gateway_dns/icon.png"
# read stream schema inf
autoloader:
  format: jsonl # json <add multiline: True>
  cloudFiles:
    schemaHints: "AccountID STRING, ApplicationID STRING, ApplicationName STRING, AuthoritativeNameServerIPs STRING, CNAMECategoryIDs STRING, CNAMECategoryNames STRING, CNAMEs STRING, CNAMEsReversed STRING, ColoCode STRING, ColoID INT, CustomResolveDurationMs INT, CustomResolverAddress STRING, CustomResolverPolicyID STRING, CustomResolverPolicyName STRING, CustomResolverResponse STRING, Datetime STRING, DeviceID STRING, DeviceName STRING, DoHSubdomain STRING, DoTSubdomain STRING, DstIP STRING, DstPort INT, EDEErrors STRING, Email STRING, InitialCategoryIDs STRING, InitialCategoryNames STRING, InitialResolvedIPs STRING, InternalDNSFallbackStrategy STRING, InternalDNSRCode INT, InternalDNSViewID STRING, InternalDNSZoneID STRING, IsResponseCached BOOLEAN, Location STRING, LocationID STRING, MatchedCategoryIDs STRING, MatchedCategoryNames STRING, MatchedIndicatorFeedIDs STRING, MatchedIndicatorFeedNames STRING, Policy STRING, PolicyID STRING, PolicyName STRING, Protocol STRING, QueryApplicationIDs STRING, QueryApplicationNames STRING, QueryCategoryIDs STRING, QueryCategoryNames STRING, QueryID STRING, QueryIndicatorFeedIDs STRING, QueryIndicatorFeedNames STRING, QueryName STRING, QueryNameReversed STRING, QuerySize INT, QueryType INT, QueryTypeName STRING, RCode INT, RData STRING, RedirectTargetURI STRING, RegistrationID STRING, RequestContextCategoryIDs STRING, RequestContextCategoryNames STRING, ResolvedIPCategoryIDs STRING, ResolvedIPCategoryNames STRING, ResolvedIPContinentCodes STRING, ResolvedIPCountryCodes STRING, ResolvedIPs STRING, ResolverDecision STRING, ResolverPolicyID STRING, ResolverPolicyName STRING, ResourceRecords STRING, ResourceRecordsJSON STRING, SrcIP STRING, SrcIPContinentCode STRING, SrcIPCountryCode STRING, SrcPort INT, TimeZone STRING, TimeZoneInferredMethod STRING, UserID STRING"
# ingest
bronze:
  preTransform:
    -
      - "*"
      - CAST(Datetime as timestamp) as time
# parse
silver:
  transform:
    - name: cloudflare_gateway_dns
      utils:
        temporaryFields:
          - name: AuthoritativeNameServerIPs_arrays
            expr: from_json(AuthoritativeNameServerIPs, 'ARRAY<STRING>')
          - name: CNAMECategoryIDs_arrays
            expr: from_json(CNAMECategoryIDs, 'ARRAY<INT>')
          - name: CNAMECategoryNames_arrays
            expr: from_json(CNAMECategoryNames, 'ARRAY<STRING>')
          - name: CNAMEs_arrays
            expr: from_json(CNAMEs, 'ARRAY<STRING>')
          - name: CNAMEsReversed_arrays
            expr: from_json(CNAMEsReversed, 'ARRAY<STRING>')
          - name: EDEErrors_arrays
            expr: from_json(EDEErrors, 'ARRAY<INT>')
          - name: InitialCategoryIDs_arrays
            expr: from_json(InitialCategoryIDs, 'ARRAY<INT>')
          - name: InitialCategoryNames_arrays
            expr: from_json(InitialCategoryNames, 'ARRAY<STRING>')
          - name: InitialResolvedIPs_arrays
            expr: from_json(InitialResolvedIPs, 'ARRAY<STRING>')
          - name: MatchedCategoryIDs_arrays
            expr: from_json(MatchedCategoryIDs, 'ARRAY<INT>')
          - name: MatchedCategoryNames_arrays
            expr: from_json(MatchedCategoryNames, 'ARRAY<STRING>')
          - name: MatchedIndicatorFeedIDs_arrays
            expr: from_json(MatchedIndicatorFeedIDs, 'ARRAY<INT>')
          - name: MatchedIndicatorFeedNames_arrays
            expr: from_json(MatchedIndicatorFeedNames, 'ARRAY<STRING>')
          - name: QueryApplicationIDs_arrays
            expr: from_json(QueryApplicationIDs, 'ARRAY<INT>')
          - name: QueryApplicationNames_arrays
            expr: from_json(QueryApplicationNames, 'ARRAY<STRING>')
          - name: QueryCategoryIDs_arrays
            expr: from_json(QueryCategoryIDs, 'ARRAY<INT>')
          - name: QueryCategoryNames_arrays
            expr: from_json(QueryCategoryNames, 'ARRAY<STRING>')
          - name: QueryIndicatorFeedIDs_arrays
            expr: from_json(QueryIndicatorFeedIDs, 'ARRAY<INT>')
          - name: QueryIndicatorFeedNames_arrays
            expr: from_json(QueryIndicatorFeedNames, 'ARRAY<STRING>')
          - name: RequestContextCategoryIDs_arrays
            expr: from_json(RequestContextCategoryIDs, 'ARRAY<INT>')
          - name: RequestContextCategoryNames_arrays
            expr: from_json(RequestContextCategoryNames, 'ARRAY<STRING>')
          - name: ResolvedIPCategoryIDs_arrays
            expr: from_json(ResolvedIPCategoryIDs, 'ARRAY<INT>')
          - name: ResolvedIPCategoryNames_arrays
            expr: from_json(ResolvedIPCategoryNames, 'ARRAY<STRING>')
          - name: ResolvedIPContinentCodes_arrays
            expr: from_json(ResolvedIPContinentCodes, 'ARRAY<STRING>')
          - name: ResolvedIPCountryCodes_arrays
            expr: from_json(ResolvedIPCountryCodes, 'ARRAY<STRING>')
          - name: ResolvedIPs_arrays
            expr: from_json(ResolvedIPs, 'ARRAY<STRING>')
          - name: RData_maps
            expr: from_json(RData, 'ARRAY<MAP<STRING,STRING>>') 
          - name: ResourceRecords_maps
            expr: from_json(ResourceRecords, 'ARRAY<MAP<STRING,STRING>>')
          - name: ResourceRecordsJSON_maps
            expr: from_json(ResourceRecordsJSON, 'ARRAY<MAP<STRING,STRING>>')
        unreferencedColumns:
          preserve: true
          omitColumns:
            - Datetime
            - AuthoritativeNameServerIPs
            - CNAMECategoryIDs
            - CNAMECategoryNames
            - CNAMEs
            - CNAMEsReversed
            - EDEErrors
            - InitialCategoryIDs
            - InitialCategoryNames
            - InitialResolvedIPs
            - MatchedCategoryIDs
            - MatchedCategoryNames
            - MatchedIndicatorFeedIDs
            - MatchedIndicatorFeedNames
            - QueryApplicationIDs
            - QueryApplicationNames
            - QueryCategoryIDs
            - QueryCategoryNames
            - QueryIndicatorFeedIDs
            - QueryIndicatorFeedNames
            - RequestContextCategoryIDs
            - RequestContextCategoryNames
            - ResolvedIPCategoryIDs
            - ResolvedIPCategoryNames
            - ResolvedIPContinentCodes
            - ResolvedIPCountryCodes
            - ResolvedIPs
            - RData
            - ResourceRecords
            - ResourceRecordsJSON
      fields:
        - name: AuthoritativeNameServerIPs
          from: AuthoritativeNameServerIPs_arrays
        - name: CNAMECategoryIDs
          from: CNAMECategoryIDs_arrays
        - name: CNAMECategoryNames
          from: CNAMECategoryNames_arrays
        - name: CNAMEs
          from: CNAMEs_arrays
        - name: CNAMEsReversed
          from: CNAMEsReversed_arrays
        - name: EDEErrors
          from: EDEErrors_arrays
        - name: InitialCategoryIDs
          from: InitialCategoryIDs_arrays
        - name: InitialCategoryNames
          from: InitialCategoryNames_arrays
        - name: InitialResolvedIPs
          from: InitialResolvedIPs_arrays
        - name: MatchedCategoryIDs
          from: MatchedCategoryIDs_arrays
        - name: MatchedCategoryNames
          from: MatchedCategoryNames_arrays
        - name: MatchedIndicatorFeedIDs
          from: MatchedIndicatorFeedIDs_arrays
        - name: MatchedIndicatorFeedNames
          from: MatchedIndicatorFeedNames_arrays
        - name: QueryApplicationIDs
          from: QueryApplicationIDs_arrays
        - name: QueryApplicationNames
          from: QueryApplicationNames_arrays
        - name: QueryCategoryIDs
          from: QueryCategoryIDs_arrays
        - name: QueryCategoryNames
          from: QueryCategoryNames_arrays
        - name: QueryIndicatorFeedIDs
          from: QueryIndicatorFeedIDs_arrays
        - name: QueryIndicatorFeedNames
          from: QueryIndicatorFeedNames_arrays
        - name: RequestContextCategoryIDs
          from: RequestContextCategoryIDs_arrays
        - name: RequestContextCategoryNames
          from: RequestContextCategoryNames_arrays
        - name: ResolvedIPCategoryIDs
          from: ResolvedIPCategoryIDs_arrays
        - name: ResolvedIPCategoryNames
          from: ResolvedIPCategoryNames_arrays
        - name: ResolvedIPContinentCodes
          from: ResolvedIPContinentCodes_arrays
        - name: ResolvedIPCountryCodes
          from: ResolvedIPCountryCodes_arrays
        - name: ResolvedIPs
          from: ResolvedIPs_arrays
        - name: RData
          from: RData_maps
        - name: ResourceRecords
          from: ResourceRecords_maps
        - name: ResourceRecordsJSON
          from: ResourceRecordsJSON_maps
# normalize
gold:
  - name: dns_activity
    input: cloudflare_gateway_dns
    fields:
      - name: answers
        expr: |
          CASE 
            -- Only parse ResourceRecordsJSON if it exists and has elements
            WHEN ResourceRecordsJSON IS NOT NULL AND size(ResourceRecordsJSON) > 0 THEN
              from_json(
                to_json(ResourceRecordsJSON),
                'array<struct<
                    rdata:string,
                    name:string,
                    class:string,
                    ttl:string,
                    type:string
                >>'
              )
            ELSE
              NULL
          END
      - name: activity_id
        expr: |
          CAST(CASE 
            WHEN answers IS NOT NULL AND size(answers) > 0 THEN 2 -- Response
            ELSE 1 -- Query
          END AS INT)
      - name: activity_name
        expr: |
          CASE 
            WHEN activity_id = 1 THEN 'Query'
            WHEN activity_id = 2 THEN 'Response'
            ELSE 'Unknown'
          END
      - name: app_name
        from: ApplicationName
      - name: category_name
        literal: Network Activity
      - name: category_uid
        expr: CAST('4' AS INT)
      - name: class_name
        literal: DNS Activity
      - name: class_uid
        expr: CAST('4003' AS INT)
      - name: connection_info.uuid
        from: DeviceID
      - name: connection_info.protocol_name
        expr: LOWER(Protocol)
      - name: dst_endpoint.ip
        from: DstIP
      - name: dst_endpoint.port
        from: DstPort
      - name: metadata.product.name
        literal: Gateway DNS
      - name: metadata.product.vendor_name
        literal: Cloudflare
      - name: query.hostname
        from: QueryName
      - name: query.type
        from: QueryTypeName
      - name: query.class
        literal: IN
      - name: query_time
        from: time
      - name: rcode # string rcode
        expr: |
          CASE
            WHEN RCode = 0 THEN 'NoError'
            WHEN RCode = 1 THEN 'FormError'
            WHEN RCode = 2 THEN 'ServError'
            WHEN RCode = 3 THEN 'NXDomain'
            WHEN RCode = 4 THEN 'NotImp'
            WHEN RCode = 5 THEN 'Refused'
            WHEN RCode = 6 THEN 'YXDomain'
            WHEN RCode = 7 THEN 'YXRRSet'
            WHEN RCode = 8 THEN 'NXRRSet'
            WHEN RCode = 9 THEN 'NotAuth'
            WHEN RCode = 10 THEN 'NotZone'
            WHEN RCode = 11 THEN 'DSOTYPENI'
            WHEN RCode = 16 THEN 'BADSIG_VERS'
            WHEN RCode = 17 THEN 'BADKEY'
            WHEN RCode = 18 THEN 'BADTIME'
            WHEN RCode = 19 THEN 'BADMODE'
            WHEN RCode = 20 THEN 'BADNAME'
            WHEN RCode = 21 THEN 'BADALG'
            WHEN RCode = 22 THEN 'BADTRUNC'
            WHEN RCode = 23 THEN 'BADCOOKIE'
            WHEN RCode BETWEEN 12 AND 15 THEN 'Unassigned'
            WHEN RCode BETWEEN 24 AND 3840 THEN 'Unassigned'
            WHEN RCode BETWEEN 3841 AND 4095 THEN 'Reserved'
            WHEN RCode BETWEEN 4096 AND 65534 THEN 'Unassigned'
            WHEN RCode = 65535 THEN 'Reserved'
            ELSE 'Other'
          END
      - name: rcode_id # numeric rcode
        from: RCode
      - name: severity
        literal: Informational
      - name: severity_id
        expr: CAST('0' AS INT)
      - name: src_endpoint.ip
        from: SrcIP
      - name: src_endpoint.port
        from: SrcPort
      - name: status # string status (event result)
        expr: |
          CASE
            WHEN RCode = 0 THEN 'Success'
            WHEN RCode BETWEEN 1 AND 65534 THEN 'Failure'
            ELSE 'Unknown'
          END
      - name: status_code # string status (numeric rcode)
        expr: CAST(RCode AS STRING)
      - name: status_detail # human-readable rcode desc
        expr: |
          CASE
            WHEN RCode = 0 THEN 'No Error'
            WHEN RCode = 1 THEN 'Format Error'
            WHEN RCode = 2 THEN 'Server Failure'
            WHEN RCode = 3 THEN 'Non-Existent Domain'
            WHEN RCode = 4 THEN 'Not Implemented'
            WHEN RCode = 5 THEN 'Query Refused'
            WHEN RCode = 6 THEN 'Name Exists When It Should Not'
            WHEN RCode = 7 THEN 'RR Set Exists When It Should Not'
            WHEN RCode = 8 THEN 'RR Set That Should Exist Does Not'
            WHEN RCode = 9 THEN 'Not Authorized or Server Not Authoritative For Zone'
            WHEN RCode = 10 THEN 'Name Not Contained in Zone'
            WHEN RCode = 11 THEN 'DSO-TYPE Not Implemented'
            WHEN RCode = 16 THEN 'TSIG Signature Failure or Bad OPT Version'
            WHEN RCode = 17 THEN 'Key Not Recognized'
            WHEN RCode = 18 THEN 'Signature Out of Time Window'
            WHEN RCode = 19 THEN 'Bad TKEY Mode'
            WHEN RCode = 20 THEN 'Duplicate Key Name'
            WHEN RCode = 21 THEN 'Algorithm Not Supported'
            WHEN RCode = 22 THEN 'Bad Truncation'
            WHEN RCode = 23 THEN 'Bad or Missing Server Cookie'
            WHEN RCode BETWEEN 12 AND 15 THEN 'Unassigned'
            WHEN RCode BETWEEN 24 AND 3840 THEN 'Unassigned'
            WHEN RCode BETWEEN 3841 AND 4095 THEN 'Reserved'
            WHEN RCode BETWEEN 4096 AND 65534 THEN 'Unassigned'
            WHEN RCode = 65535 THEN 'Reserved'
            ELSE 'Other'
          END
      - name: status_id # numeric status (numeric rcode)
        from: RCode
      - name: time
        from: time
      - name: type_name
        expr: "CONCAT('DNS Activity: ', activity_name, ' [', QueryTypeName, ']')"
      - name: type_uid
        expr: CAST(class_uid*100 + activity_id as long)
      - name: unmapped.QueryType
        from: QueryType
