name: aws_sec_lake_waf
author: Antimatter
description: "Recommended preset for processing `AWS WAFv2 logs` data from AWS Security Lake"
autoloader:
  format: parquet
  cloudFiles:
    schemaHints: "action string,action_id int,activity_id int,activity_name string,category_name string,category_uid int,class_name string,class_uid int,type_name string,type_uid bigint,time bigint,time_dt timestamp,disposition_id int,disposition string,cloud struct<provider:string>,firewall_rule struct<condition:string,match_details:array<string>,match_location:string,rate_limit:int,type:string,uid:string>,http_request struct<args:string,http_headers:array<struct<name:string,value:string>>,http_method:string,referrer:string,uid:string,url:struct<hostname:string,path:string>,user_agent:string,version:string,x_forwarded_for:array<string>>,http_status int,metadata struct<labels:array<string>,product:struct<feature:struct<uid:string>,name:string,vendor_name:string,version:string>,profiles:array<string>,version:string>,observables array<struct<name:string,type:string,type_id:int,value:string>>,severity string,severity_id int,src_endpoint struct<ip:string,location:struct<country:string>,svc_name:string,uid:string>,unmapped map<string,string>,_rescued_data string"
silver:
  transform:
    - name: aws_sec_lake_waf_http_activity
      filter: "class_uid = 4002"
      fields:
        - name: activity_id
          from: activity_id
        - name: activity_name
          from: activity_name
        - name: category_uid
          from: category_uid
        - name: category_name
          from: category_name
        - name: class_uid
          from: class_uid
        - name: class_name
          from: class_name
        - name: metadata
          from: metadata
        - name: severity_id
          from: severity_id
        - name: severity
          from: severity
        - name: time
          expr: timestamp_millis(time)
        - name: time_dt
          from: time_dt
        - name: type_uid
          from: type_uid
        - name: type_name
          from: type_name
        - name: observables
          from: observables
        - name: unmapped
          from: unmapped
        - name: action
          from: action
        - name: cloud
          from: cloud
        - name: disposition
          from: disposition
        - name: disposition_id
          from: disposition_id
        - name: firewall_rule
          from: firewall_rule
        - name: http_request
          from: http_request
        - name: http_status
          from: http_status
        - name: src_endpoint
          from: src_endpoint
      utils:
        unreferencedColumns:
          preserve: true
          omitColumns:
            - time
gold:
  - name: http_activity
    input: aws_sec_lake_waf_http_activity
    fields:
      - name: activity_id
        from: activity_id
      - name: activity_name
        from: activity_name
      - name: category_uid
        from: category_uid
      - name: category_name
        from: category_name
      - name: class_uid
        from: class_uid
      - name: class_name
        from: class_name
      - name: metadata
        from: metadata
      - name: severity_id
        from: severity_id
      - name: severity
        from: severity
      - name: time
        from: time
      - name: time_dt
        from: time_dt
      - name: type_uid
        from: type_uid
      - name: type_name
        from: type_name
      - name: observables
        from: observables
      - name: action
        from: action
      - name: cloud
        from: cloud
      - name: disposition
        from: disposition
      - name: disposition_id
        from: disposition_id
      - name: firewall_rule
        from: firewall_rule
      - name: http_request
        from: http_request
      - name: http_status
        from: http_status
      - name: src_endpoint
        from: src_endpoint
