name: aws_sec_lake_vpc_flow
author: Antimatter
description: "AWS Security Lake VPC Flow Logs"
title: "AWS SecLake - VPC"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/aws_sec_lake/vpc_flow/icon.png"
autoloader:
  format: parquet
  multiline: true
  cloudFiles:
    schemaHints: >
      metadata struct<product:struct<version:string,name:string,feature:struct<name:string>,vendor_name:string>,profiles:array<string>,version:string>,
      cloud struct<account:struct<uid:string>,region:string,zone:string,provider:string>,
      src_endpoint struct<port:int,svc_name:string,ip:string,intermediate_ips:array<string>,interface_uid:string,vpc_uid:string,instance_uid:string,subnet_uid:string>,
      dst_endpoint struct<port:int,svc_name:string,ip:string,intermediate_ips:array<string>,interface_uid:string,vpc_uid:string,instance_uid:string,subnet_uid:string>,
      connection_info struct<protocol_num:int,tcp_flags:int,protocol_ver:string,boundary_id:int,boundary:string,direction_id:int,direction:string>,
      traffic struct<packets:bigint,bytes:bigint>,
      time bigint,
      time_dt timestamp,
      start_time_dt timestamp,
      end_time_dt timestamp,
      status_code string,
      severity_id int,
      severity string,
      class_name string,
      class_uid int,
      category_name string,
      category_uid int,
      activity_name string,
      activity_id int,
      action string,
      action_id int,
      disposition string,
      type_uid bigint,
      type_name string,
      accountId bigint,
      region string,
      asl_version string,
      unmapped map<string,string>,
      observables array<struct<name:string,value:string,type:string,type_id:int>>,
      eventDay int,
      _rescued_data string
silver:
  transform:
    - name: aws_sec_lake_vpc_flow
      filter: "class_uid = 4001"
      fields:
        - name: activity_id
          from: activity_id
        - name: activity_name
          from: activity_name
        - name: category_uid
          from: category_uid
        - name: category_name
          from: category_name
        - name: class_uid
          from: class_uid
        - name: end_time_dt
          from: end_time_dt
        - name: class_name
          from: class_name
        - name: metadata
          from: metadata
        - name: observables
          from: observables
        - name: severity_id
          from: severity_id
        - name: severity
          from: severity
        - name: start_time_dt
          from: start_time_dt
        - name: status_code
          from: status_code
        - name: time
          expr: timestamp_millis(time)
        - name: time_dt
          from: time_dt
        - name: type_uid
          from: type_uid
        - name: type_name
          from: type_name
        - name: unmapped
          from: unmapped
        - name: cloud
          from: cloud
        - name: action
          from: action
        - name: action_id
          from: action_id
        - name: disposition
          from: disposition
        - name: connection_info
          from: connection_info
        - name: dst_endpoint
          from: dst_endpoint
        - name: src_endpoint
          from: src_endpoint
        - name: traffic
          from: traffic
      utils:
        unreferencedColumns:
          preserve: true
          omitColumns:
            - time
gold:
  - name: network_activity
    input: aws_sec_lake_vpc_flow
    fields:
      - name: activity_id
        from: activity_id
      - name: activity_name
        from: activity_name
      - name: category_uid
        from: category_uid
      - name: category_name
        from: category_name
      - name: class_uid
        from: class_uid
      - name: end_time
        from: end_time_dt
      - name: class_name
        from: class_name
      - name: metadata
        from: metadata
      - name: observables
        from: observables
      - name: severity_id
        from: severity_id
      - name: severity
        from: severity
      - name: start_time
        from: start_time_dt
      - name: status_code
        from: status_code
      - name: time
        from: time
      - name: type_uid
        from: type_uid
      - name: type_name
        from: type_name
      - name: cloud
        from: cloud
      - name: action
        from: action
      - name: action_id
        from: action_id
      - name: disposition
        from: disposition
      - name: connection_info
        from: connection_info
      - name: dst_endpoint
        from: dst_endpoint
      - name: src_endpoint
        from: src_endpoint
      - name: traffic
        from: traffic
