# header tags
name: cloudflare_firewall_events
title: "Cloudflare - Firewall (Events)"
author: Garrett R Peternel <garrett.peternel@databricks.com>
description: "A preset for Zone-scoped Cloudflare datasets - Firewall (Events)"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/cloudflare/firewall_events/icon.png"
# read stream schema inf
autoloader:
  format: jsonl # json <add multiline: True>
  cloudFiles:
    schemaHints: "Action STRING, ClientASN INT, ClientASNDescription STRING, ClientCountry STRING, ClientIP STRING, ClientIPClass STRING, ClientRefererHost STRING, ClientRefererPath STRING, ClientRefererQuery STRING, ClientRefererScheme STRING, ClientRequestHost STRING, ClientRequestMethod STRING, ClientRequestPath STRING, ClientRequestProtocol STRING, ClientRequestQuery STRING, ClientRequestScheme STRING, ClientRequestUserAgent STRING, ContentScanObjResults STRING, ContentScanObjSizes STRING, ContentScanObjTypes STRING, Datetime STRING, Description STRING, EdgeColoCode STRING, EdgeResponseStatus INT, Kind STRING, LeakedCredentialCheckResult STRING, MatchIndex INT, Metadata STRING, OriginResponseStatus INT, OriginatorRayID STRING, RayID STRING, Ref STRING, RuleID STRING, Source STRING"
# ingest
bronze:
  preTransform:
    -
      - "*"
      - CAST(Datetime as TIMESTAMP) as time
      - CAST('cloudflare' AS STRING) AS data_source # duplicate col <Source> in log; rename to data_source
      - CAST('firewall_events' AS STRING) AS data_sourcetype
# parse
silver:
  transform:
    - name: cloudflare_firewall_events
      utils:
        temporaryFields:
          - name: ContentScanObjResults_arrays
            expr: from_json(ContentScanObjResults, 'ARRAY<STRING>')
          - name: ContentScanObjSizes_arrays
            expr: from_json(ContentScanObjSizes, 'ARRAY<INT>')
          - name: ContentScanObjTypes_arrays
            expr: from_json(ContentScanObjTypes, 'ARRAY<STRING>')
          - name: Metadata_maps
            expr: from_json(Metadata, 'MAP<STRING,STRING>')
        unreferencedColumns:
          preserve: true
          omitColumns:
            - Datetime
            - ContentScanObjResults
            - ContentScanObjSizes
            - ContentScanObjTypes
            - Metadata
      fields:
        - name: ContentScanObjResults
          from: ContentScanObjResults_arrays
        - name: ContentScanObjSizes
          from: ContentScanObjSizes_arrays
        - name: ContentScanObjTypes
          from: ContentScanObjTypes_arrays
        - name: Metadata
          from: Metadata_maps
# normalize
gold:
  - name: network_activity
    input: cloudflare_firewall_events
    fields:
      - name: action
        from: Action
      - name: action_id
        expr: |
          CASE
            WHEN LOWER(Action) IN ('allow', 'bypass') THEN 1
            WHEN LOWER(Action) = 'block' THEN 2
            WHEN LOWER(Action) IN ('challenge', 'jschallenge', 'managedchallenge') THEN 3
            ELSE 99
          END
      - name: activity_id
        expr: |
          CASE
            WHEN LOWER(Action) = 'connectionclose' THEN 2
            WHEN LOWER(Action) = 'block' THEN 5
            WHEN LOWER(Action) IN (
                 'allow',
                 'challenge',
                 'jschallenge',
                 'log',
                 'challengesolved',
                 'challengebypassed',
                 'jschallengesolved',
                 'jschallengebypassed',
                 'bypass',
                 'managedchallenge',
                 'managedchallengenoninteractivesolved',
                 'managedchallengeinteractivesolved',
                 'managedchallengebypassed'
            ) THEN 6
            ELSE 99
          END
      - name: activity_name
        expr: |
          CASE
            WHEN activity_id = 0 THEN 'Unknown'
            WHEN activity_id = 1 THEN 'Open'
            WHEN activity_id = 2 THEN 'Close'
            WHEN activity_id = 3 THEN 'Reset'
            WHEN activity_id = 4 THEN 'Fail'
            WHEN activity_id = 5 THEN 'Refuse'
            WHEN activity_id = 6 THEN 'Traffic'
            WHEN activity_id = 7 THEN 'Listen'
            ELSE 'Other'
          END
      - name: category_name
        literal: Network Activity
      - name: category_uid
        expr: CAST('4' AS INT)
      - name: class_name
        literal: Network Activity
      - name: class_uid
        expr: CAST('4001' AS INT)
      - name: connection_info.protocol_name
        expr: ClientRequestProtocol
      - name: disposition
        expr: |
          CASE
            WHEN LOWER(Action) IN ('allow', 'bypass', 'log') THEN 'Allowed'
            WHEN LOWER(Action) IN ('block', 'connectionclose') THEN 'Blocked'
            WHEN LOWER(Action) IN ('challenge', 'jschallenge', 'managedchallenge') THEN 'Quarantined'
            ELSE 'Unknown'
          END
      - name: disposition_id
        expr: |
          CASE
            WHEN disposition = 'Allowed' THEN 1
            WHEN disposition = 'Blocked' THEN 2
            WHEN disposition = 'Quarantined' THEN 3
            WHEN disposition = 'Unknown' THEN 0
            ELSE 99
          END
      - name: message
        from: Description
      - name: metadata.version
        literal: 1.0.0
      - name: metadata.product.vendor_name
        literal: Cloudflare
      - name: metadata.product.name
        literal: Firewall Events
      - name: metadata.log_provider
        literal: Cloudflare Firewall Events
      - name: severity
        expr: |
          CASE
            WHEN LOWER(Action) = 'block' AND LOWER(Source) = 'waf' THEN 'Critical'
            WHEN LOWER(Action) IN ('block', 'connectionclose') THEN 'High'
            WHEN LOWER(Action) IN ('challenge', 'jschallenge', 'managedchallenge') THEN 'Medium'
            WHEN LOWER(Action) IN ('challengesolved', 'jschallengesolved', 'challengebypassed', 'jschallengebypassed', 'managedchallengebypassed', 'managedchallengeinteractivesolved', 'managedchallengenoninteractivesolved') THEN 'Low'
            WHEN LOWER(Action) IN ('allow', 'bypass', 'log') THEN 'Informational'
            ELSE 'Unknown'
          END
      - name: severity_id 
        expr: |
          CASE
            WHEN LOWER(Action) = 'block' AND LOWER(Source) = 'waf' THEN 5
            WHEN LOWER(Action) IN ('block', 'connectionclose') THEN 4
            WHEN LOWER(Action) IN ('challenge', 'jschallenge', 'managedchallenge') THEN 3
            WHEN LOWER(Action) IN ('challengesolved', 'jschallengesolved', 'challengebypassed', 'jschallengebypassed', 'managedchallengebypassed', 'managedchallengeinteractivesolved', 'managedchallengenoninteractivesolved') THEN 2
            WHEN LOWER(Action) IN ('allow', 'bypass', 'log') THEN 1
            ELSE 0
          END
      - name: src_endpoint.ip
        from: ClientIP
      - name: src_endpoint.domain
        from: ClientRequestHost
      - name: src_endpoint.location.country
        from: ClientCountry
      - name: src_endpoint.zone
        expr: COALESCE(Metadata['zone_name'], 'Unknown')
      - name: status
        expr: |
          CASE
            WHEN LOWER(Action) IN ('allow', 'bypass', 'log') THEN 'Success'
            WHEN LOWER(Action) IN ('block', 'connectionclose') THEN 'Failure'
            WHEN LOWER(Action) IN ('challenge', 'jschallenge', 'managedchallenge', 'challengesolved', 'jschallengesolved', 'challengebypassed', 'jschallengebypassed', 'managedchallengebypassed', 'managedchallengeinteractivesolved', 'managedchallengenoninteractivesolved') THEN 'Other'
            ELSE 'Unknown'
          END
      - name: status_code
        expr: CAST(EdgeResponseStatus AS STRING)
      - name: status_detail # string concatenation <action,desc,rule,source>
        expr: |
          CONCAT(
            'Action: ', Action,
            '; Description: ', Description,
            '; RuleID: ', COALESCE(CAST(RuleID AS STRING), 'N/A'),
            '; Source: ', COALESCE(Source, 'N/A')
            )
      - name: status_id
        expr: |
          CASE
            WHEN status = 'Success' THEN 1
            WHEN status = 'Failure' THEN 2
            WHEN status = 'Unknown' THEN 0
            ELSE 99
          END
      - name: time
        from: time
      - name: type_name
        expr: "CONCAT('Network Activity: ', activity_name)"
      - name: type_uid
        expr: CAST(class_uid * 100 + activity_id as long)
      - name: url.scheme
        from: ClientRequestScheme
      - name: url.hostname
        from: ClientRequestHost
      - name: url.path
        from: ClientRequestPath
      - name: url.query_string
        from: ClientRequestQuery
      - name: url.url_string
        expr: |
          CONCAT(
            COALESCE(ClientRequestScheme, ''), '://',
            COALESCE(ClientRequestHost, ''),
            COALESCE(ClientRequestPath, ''),
            CASE WHEN ClientRequestQuery IS NOT NULL AND ClientRequestQuery != '' 
              THEN CONCAT('?', ClientRequestQuery) 
              ELSE '' 
            END
          )
      - name: metadata.correlation_uid
        from: RayID
      - name: metadata.uid
        from: RayID
      - name: observables
        expr: |
          ARRAY(
            STRUCT(
              'Client IP' AS name,
              'IP Address' AS type,
              ClientIP AS value
            ),
            STRUCT(
              'Request Host' AS name,
              'Hostname' AS type,
              ClientRequestHost AS value
            ),
            STRUCT(
              'Ray ID' AS name,
              'Resource UID' AS type,
              RayID AS value
            ),
            STRUCT(
              'Rule ID' AS name,
              'Resource UID' AS type,
              CAST(RuleID AS STRING) AS value
            )
          )
      - name: enrichments
        expr: |
          FILTER(
            ARRAY(
              CASE 
                WHEN ContentScanObjResults IS NOT NULL AND SIZE(ContentScanObjResults) > 0 THEN
                  STRUCT(
                    'Content Scan Results' AS name,
                    'Content scanning detected objects' AS desc,
                    CAST(NULL AS VARIANT) AS data,
                    ARRAY_JOIN(ContentScanObjResults, ', ') AS value
                  )
                ELSE NULL
              END,
              CASE 
                WHEN LeakedCredentialCheckResult IS NOT NULL THEN
                  STRUCT(
                    'Leaked Credential Check' AS name,
                    'Credential leak detection result' AS desc,
                    CAST(NULL AS VARIANT) AS data,
                    LeakedCredentialCheckResult AS value
                  )
                ELSE NULL
              END,
              CASE 
                WHEN ClientIPClass IS NOT NULL THEN
                  STRUCT(
                    'Client IP Classification' AS name,
                    'IP address classification' AS desc,
                    CAST(NULL AS VARIANT) AS data,
                    ClientIPClass AS value
                  )
                ELSE NULL
              END,
              CASE 
                WHEN ClientASN IS NOT NULL THEN
                  STRUCT(
                    'Client ASN' AS name,
                    'Autonomous System Number' AS desc,
                    CAST(NULL AS VARIANT) AS data,
                    CONCAT('AS', CAST(ClientASN AS STRING), ' - ', COALESCE(ClientASNDescription, 'N/A')) AS value
                  )
                ELSE NULL
              END
            ),
            x -> x IS NOT NULL
          )
      - name: unmapped
        expr: |
          CAST(
            to_json(
              named_struct(
                'EdgeColoCode', EdgeColoCode,
                'EdgeResponseStatus', EdgeResponseStatus,
                'OriginResponseStatus', OriginResponseStatus,
                'OriginatorRayID', OriginatorRayID,
                'ClientASN', ClientASN,
                'ClientASNDescription', ClientASNDescription,
                'ClientIPClass', ClientIPClass,
                'ClientRequestMethod', ClientRequestMethod,
                'ClientRequestProtocol', ClientRequestProtocol,
                'ClientRequestUserAgent', ClientRequestUserAgent,
                'ClientRefererHost', ClientRefererHost,
                'ClientRefererPath', ClientRefererPath,
                'ClientRefererQuery', ClientRefererQuery,
                'ClientRefererScheme', ClientRefererScheme,
                'LeakedCredentialCheckResult', LeakedCredentialCheckResult,
                'ContentScanObjResults', ContentScanObjResults,
                'ContentScanObjSizes', ContentScanObjSizes,
                'ContentScanObjTypes', ContentScanObjTypes,
                'Kind', Kind,
                'MatchIndex', MatchIndex,
                'Metadata', Metadata,
                'RuleID', RuleID,
                'Ref', Ref,
                'Source', Source,
                'Description', Description
              )
            ) AS VARIANT
          )