name: zeek_http
description: "Zeek HTTP logs"
title: "Zeek HTTP"
iconURL: "https://raw.githubusercontent.com/antimatterhq/dasl-content-packs/refs/heads/main/presets/zeek/http/icon.png"
author: "Antimatter"
autoloader:
  format: json

bronze:
  loadAsSingleVariant: true
  preTransform:
    -
      - "data"
      - cast(data:ts as timestamp) as time
      - cast('zeek' as STRING) as source
      - cast('http' as STRING) as sourcetype
silver:
  transform:
    - name: zeek_http
      fields:
        - name: id_origin_host
          expr: try_cast(data:['id.orig_h'] as STRING)
        - name: id_origin_port
          expr: try_cast(data:['id.orig_p'] as INT)
        - name: id_response_host
          expr: try_cast(data:['id.resp_h'] as STRING)
        - name: id_response_port
          expr: try_cast(data:['id.resp_p'] as INT)
        - name: method
          expr: data:method::STRING
      utils:
        unreferencedColumns:
          preserve: true
          omitColumns:
            - data:['id.resp_h']
            - data:['id.orig_h']
            - data:ts
            - data:['id.resp_p']
            - data:['id.orig_p']
gold:
  - name: http_activity
    input: zeek_http
    fields:
      - name: activity_id
        expr: CASE WHEN LOWER(method) = 'connect' THEN 1 WHEN LOWER(method) = 'delete' THEN 2 WHEN LOWER(method) = 'get' THEN 3 WHEN LOWER(method) = 'head' THEN 4 WHEN LOWER(method) = 'options' THEN 5 WHEN LOWER(method) = 'post' THEN 6 WHEN LOWER(method) = 'put' THEN 7 WHEN LOWER(method) = 'trace' THEN 8 WHEN method IS NULL OR method = '' THEN 0 ELSE 99 END
      - name: activity_name
        expr: CASE WHEN method IS NULL OR method = '' THEN method ELSE CONCAT(UPPER(SUBSTRING(method, 1, 1)), LOWER(SUBSTRING(method, 2))) END
      - name: category_uid
        expr: CAST('4' AS INT)
      - name: category_name
        literal: Network Activity
      - name: class_uid
        expr: CAST('4002' AS INT)
      - name: class_name
        literal: HTTP Activity
      - name: severity_id
        expr: CAST('1' AS INT)
      - name: severity
        literal: Informational
      - name: type_uid
        expr: CAST((400200 + activity_id) AS BIGINT)
      - name: type_name
        expr: "CASE WHEN method IS NOT NULL THEN CONCAT('HTTP Activity: ', method) ELSE null END"
      - name: time
        from: time
      - name: http_request.http_method
        expr: method
      - name: http_request.user_agent
        expr: data:user_agent::STRING
      - name: http_request.body_length
        expr: cast(data:request_body_len as int)
      - name: http_request.version
        expr: data:version::STRING
      - name: http_request.url
        expr: data:uri::STRING
      - name: http_request.referrer
        expr: data:referrer::STRING
      - name: http_response.code
        expr: data:status_code::INT
      - name: http_response.body_length
        expr: cast(data:response_body_len as int)
      - name: metadata.product.vendor_name
        literal: Zeek
      - name: metadata.product.name
        literal: Zeek HTTP
      - name: metadata.uid
        expr: data:uid::STRING
      - name: metadata.processed_time
        expr: current_timestamp()
      - name: metadata.logged_time
        from: time
      - name: metadata.log_name
        literal: http
      - name: metadata.log_provider
        literal: zeek
      - name: src_endpoint.hostname
        expr: data:host::STRING
      - name: src_endpoint.ip
        from: id_origin_host
      - name: dst_endpoint.ip
        from: id_response_host
      - name: src_endpoint.port
        from: id_origin_port
      - name: dst_endpoint.port
        from: id_response_port
      - name: raw_data
        from: data
      - name: status_id
        expr: |
          CASE
            WHEN data:status_code::INT BETWEEN 100 AND 399 THEN 1
            WHEN data:status_code::INT BETWEEN 400 AND 599 THEN 2
            ELSE 0                                         
          END
      - name: status
        expr: |
          CASE
            WHEN data:status_code::INT BETWEEN 100 AND 399 THEN 'Success'
            WHEN data:status_code::INT BETWEEN 400 AND 599 THEN 'Failure'
            ELSE 'Unknown'
          END
      - name: status_code
        expr: data:status_code::STRING
      - name: status_detail
        expr: data:status_msg::STRING
