name: apache_access_log
author: Alex Ott
description: "A preset for consuming access logs generated by Apache Web server"
autoloader:
  format: text
silver:
  transform:
    - name: apache_access_log
      fields: # TODO: Handle `-` for user, referrer, etc. - convert them into `null`
        - name: host
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 1)
        - name: user
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 3)
        - name: time
          expr: cast(unix_timestamp(regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 4), 'dd/MMM/yyyy:HH:mm:ss Z') as timestamp)
        - name: method
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 5)
        - name: path
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 6)
        - name: version
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 7)
        - name: code
          expr: try_cast(regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 8) as int)
        - name: size
          expr: try_cast(regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 9) as long)
        - name: referrer
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 10)
        - name: agent
          expr: regexp_extract(value, '^(\\S+) (\\S+) (\\S+) \\[(.+?)] "(\\w+) (\\S+) ([^"]+)" (\\d{3}) (\\d+|-) "(.+)" "(.+)"?$', 11)
      utils:
        unreferencedColumns:
          preserve: true
gold:
  - name: http_activity
    input: apache_access_log
    fields:
      - name: activity_id
        expr: CASE WHEN LOWER(method) = 'connect' THEN 1 WHEN LOWER(method) = 'delete' THEN 2 WHEN LOWER(method) = 'get' THEN 3 WHEN LOWER(method) = 'head' THEN 4 WHEN LOWER(method) = 'options' THEN 5 WHEN LOWER(method) = 'post' THEN 6 WHEN LOWER(method) = 'put' THEN 7 WHEN LOWER(method) = 'trace' THEN 8 WHEN method IS NULL OR method = '' THEN 0 ELSE 99 END
      - name: activity_name
        expr: CASE WHEN method IS NULL OR method = '' THEN method ELSE CONCAT(UPPER(SUBSTRING(method, 1, 1)), LOWER(SUBSTRING(method, 2))) END
      - name: category_uid
        expr: CAST('4' AS INT)
      - name: category_name
        literal: Network Activity
      - name: class_uid
        expr: CAST('4002' AS INT)
      - name: class_name
        literal: HTTP Activity
      - name: severity_id
        expr: CAST('0' AS INT)
      - name: severity
        literal: Unknown
      - name: type_uid
        expr: CAST((400200 + CASE WHEN LOWER(method) = 'connect' THEN 1 WHEN LOWER(method) = 'delete' THEN 2 WHEN LOWER(method) = 'get' THEN 3 WHEN LOWER(method) = 'head' THEN 4 WHEN LOWER(method) = 'options' THEN 5 WHEN LOWER(method) = 'post' THEN 6 WHEN LOWER(method) = 'put' THEN 7 WHEN LOWER(method) = 'trace' THEN 8 WHEN method IS NULL OR method = '' THEN 0 ELSE 99 END) AS BIGINT)
      - name: type_name
        expr: "CASE WHEN method IS NOT NULL THEN CONCAT('HTTP Activity: ', method) ELSE null END"
      - name: time
        from: time
      - name: start_time
        from: time
      - name: http_status
        from: code
      - name: http_request.http_method
        from: method
      - name: http_request.user_agent
        from: agent
      - name: http_request.version
        from: version
      - name: http_request.url.url_string
        from: path
      - name: http_request.referrer
        from: referrer
      - name: http_response.code
        from: code
      - name: http_response.length
        expr: cast(size as int)  # temporary workaround until table is fixed
      - name: metadata.product.vendor_name
        literal: Apache Web
      - name: src_endpoint.hostname
        from: host
      - name: raw_data
        from: value
