name: aws_sec_lake_eks_audit
author: Antimatter
description: "AWS EKS control plane data collected with AWS Security Lake"
autoloader:
  format: parquet
  multiline: true
  cloudFiles:
    schemaHints: "metadata struct<log_level:string,product:struct<version:string,vendor_name:string,name:string,feature:struct<name:string>>,profiles:array<string>,version:string>,api struct<request:struct<uid:string,containers:array<struct<name:string,image:struct<name:string,path:string,uid:string>>>>,operation:string,version:string,response:struct<code:int,message:string,error:string,error_message:string,containers:array<struct<name:string,image:struct<name:string,path:string,uid:string>>>>,group:struct<name:string>>,message string,http_request struct<url:struct<path:string>,user_agent:string>,actor struct<user:struct<name:string,uid:string,groups:array<struct<name:string>>,type_id:int>,session:struct<credential_uid:string,issuer:string,uid:string>>,cloud struct<account:struct<uid:string>,provider:string>,src_endpoint struct<ip:string,intermediate_ips:array<string>>,resources array<struct<namespace:string,name:string,uid:string,version:string,type:string>>,start_time_dt timestamp,time_dt timestamp,time bigint,severity_id int,severity string,class_name string,class_uid int,category_name string,category_uid int,activity_name string,activity_id int,type_name string,type_uid bigint,unmapped map<string,string>,accountId bigint,region string,asl_version string,observables array<struct<name:string,value:string,type:string,type_id:int>>,eventDay int,_rescued_data string"
silver:
  transform:
    - name: aws_sec_lake_eks_audit_api_activity
      filter: "class_uid = 6003"
      fields:
        - name: activity_id
          from: activity_id
        - name: activity_name
          from: activity_name
        - name: category_uid
          from: category_uid
        - name: category_name
          from: category_name
        - name: class_uid
          from: class_uid
        - name: class_name
          from: class_name
        - name: message
          from: message
        - name: metadata
          from: metadata
        - name: severity_id
          from: severity_id
        - name: severity
          from: severity
        - name: start_time_dt
          from: start_time_dt
        - name: time
          expr: timestamp_millis(time)
        - name: time_dt
          from: time_dt
        - name: type_uid
          from: type_uid
        - name: type_name
          from: type_name
        - name: observables
          from: observables
        - name: unmapped
          from: unmapped
        - name: api
          from: api
        - name: cloud
          from: cloud
        - name: actor
          from: actor
        - name: http_request
          from: http_request
        - name: resources
          from: resources
        - name: src_endpoint
          from: src_endpoint
      utils:
        unreferencedColumns:
          preserve: true
          omitColumns:
            - time
gold:
  - name: api_activity
    input: aws_sec_lake_eks_audit_api_activity
    fields:
      - name: activity_id
        from: activity_id
      - name: activity_name
        from: activity_name
      - name: category_uid
        from: category_uid
      - name: category_name
        from: category_name
      - name: class_uid
        from: class_uid
      - name: class_name
        from: class_name
      - name: message
        from: message
      - name: metadata
        from: metadata
      - name: severity_id
        from: severity_id
      - name: severity
        from: severity
      - name: start_time_dt
        from: start_time_dt
      - name: time
        from: time
      - name: time_dt
        from: time_dt
      - name: type_uid
        from: type_uid
      - name: type_name
        from: type_name
      - name: observables
        from: observables
      - name: api
        from: api
      - name: cloud
        from: cloud
      - name: actor
        from: actor
      - name: http_request
        from: http_request
      - name: resources
        from: resources
      - name: src_endpoint
        from: src_endpoint
